app/controllers/projects_controller.rb

  def show
    @my_project = Project.find_by(id: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]